Table of Contents
 Interface IProjectContentStorage
Namespace
IdeaStatiCa.Plugin.ProjectContent
Assembly
IdeaStatiCa.Plugin.dll
Storage of project items
public interface IProjectContentStorage
Methods
 ReadData(string, Stream)
Get data from storage and write them to outputStream
int ReadData(string contentId, Stream outputStream)
Parameters
contentId string
valid Id of the requested project content.
outputStream Stream
Open Stream for writing to store result.
Returns
int
1
Exceptions
Exception
Exception is thrown if the operation fails
 WriteData(string, Stream)
Write data to storage
int WriteData(string contentId, Stream inputStream)
Parameters
contentId string
Name of the project item
inputStream Stream
Returns
int
1
Exceptions
Exception
Exception is thrown if the operation fails
 Edit this page